@nkatarmal-crest I don't know if that's the right one, the name is strange but the class looks right.
However, if it is supposed to be used for the EPG-to-AAEP relation, it is missing a couple important attributes:
encap
mode

I went ahead and tried it, here's what the plan looks like:
```
Terraform will perform the following actions:

  # module.tier3.aci_vlan_encapsulationfor_vxlan_traffic.aaep["relation1"] will be created
  + resource "aci_vlan_encapsulationfor_vxlan_traffic" "aaep" {
      + annotation                          = (known after apply)
      + attachable_access_entity_profile_dn = "uni/infra/attentp-Physical-AAEP"
      + description                         = (known after apply)
      + id                                  = (known after apply)
      + name_alias                          = (known after apply)
      + relation_infra_rs_func_to_epg       = [
          + "uni/tn-TENANT1/ap-Production-Network/epg-VLAN5-EPG",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Here are the results:
```
module.tier3.aci_vlan_encapsulationfor_vxlan_traffic.aaep["relation1"]: Creating...
module.tier3.aci_vlan_encapsulationfor_vxlan_traffic.aaep["relation1"]: Creation complete after 0s [id=uni/infra/attentp-Physical-AAEP/provacc]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

But no relation is made in ACI. Here's the trace:
```
2020-06-24T07:50:43.333-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 [DEBUG] Exit from errors {"imdata":[],"totalCount":"0"}
2020-06-24T07:50:43.333-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 HTTP request POST /api/node/mo.json &{POST https://192.168.253.17/api/node/mo.json HTTP/1.1 1 1 map[] {{"infraRsFuncToEpg":{"attributes":{"dn":"uni/infra/attentp-Physical-AAEP/provacc/provacc/rsfuncToEpg-[uni/tn-TENANT1/ap-Production-Network/epg-VLAN5-EPG]"}}}} 0x765d90 157 [] false 192.168.253.17 map[] map[] <nil> map[]   <nil> <nil> <nil> 0xc00003a0a8}
2020-06-24T07:50:43.333-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 [DEBUG] Begin Injection
2020-06-24T07:50:43.333-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 HTTP request after injection POST /api/node/mo.json &{POST https://192.168.253.17/api/node/mo.json HTTP/1.1 1 1 map[Cookie:[APIC-Cookie=owUAAAAAAAAAAAAAAAAAACgeG5+R8TwtOanVHaD0lq66CEBmOBsq45QbkyBTe/K5dxDJoedvg9aeC5ql5Xm8WRiaueE4YFeiM4qX1eLXTy6sH9ajeNOHOluhbqWA+kNJuKQqgD78Q2Odeg4793/XOqAWCO6DCoaR6bAzrVQ9vhx+wBT9Y6rywpXNvRTqIjEC259/8yb0iqfL4521eHihDg==]] {{"infraRsFuncToEpg":{"attributes":{"dn":"uni/infra/attentp-Physical-AAEP/provacc/provacc/rsfuncToEpg-[uni/tn-TENANT1/ap-Production-Network/epg-VLAN5-EPG]"}}}} 0x765d90 157 [] false 192.168.253.17 map[] map[] <nil> map[]   <nil> <nil> <nil> 0xc00003a0a8}
2020-06-24T07:50:43.333-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 [DEBUG] Begining DO method https://192.168.253.17/api/node/mo.json
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci: 
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci: 
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci:  HTTP request: {}
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci: HTTP Request: POST https://192.168.253.17/api/node/mo.json
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 nHTTP Response: 400 400 Bad Request &{400 Bad Request 400 HTTP/1.1 1 1 map[Access-Control-Allow-Credentials:[false] Access-Control-Allow-Headers:[Origin, X-Requested-With, Content-Type, Accept, devcookie, APIC-challenge, Request-Tag] Access-Control-Allow-Methods:[POST,GET,OPTIONS,DELETE] Access-Control-Allow-Origin:[http://127.0.0.1:8000] Connection:[keep-alive] Content-Length:[270] Content-Type:[application/json] Date:[Thu, 11 Jun 2020 13:21:10 GMT] Server:[Cisco APIC]] 0xc0001af340 270 [] false false map[] 0xc0001fc800 0xc00077cfd0}
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci:  HTTP response unique string POST https://192.168.253.17/api/node/mo.json {"totalCount":"1","imdata":[{"error":{"attributes":{"code":"120","text":"unknown property value uni\/infra\/attentp-Physical-AAEP\/provacc\/provacc\/rsfuncToEpg-[uni\/tn-TENANT1\/ap-Production-Network\/epg-VLAN5-EPG], name dn, class infraRsFuncToEpg [(Dn0)] Dn0=, "}}}]}
2020-06-24T07:50:43.348-0500 [DEBUG] plugin.terraform-provider-aci: 2020/06/24 07:50:43 [DEBUG] Exit from do method
```

And here's what a good post looks like, adding the relation manually, from the API Inspector:
```
method: POST
url: https://apic/api/node/mo/uni/infra/attentp-Physical-AAEP/gen-default.json
payload{"infraGeneric":{"attributes":{"dn":"uni/infra/attentp-Physical-AAEP/gen-default","name":"default","status":"created,modified"},"children":[{"infraRsFuncToEpg":{"attributes":{"tDn":"uni/tn-TENANT1/ap-Production-Network/epg-VLAN5-EPG","status":"created,modified","encap":"vlan-5"},"children":[]}}]}}
response: {"totalCount":"0","imdata":[]}
```